validation/diluteVdfTransportFoam/riser/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     diluteCoupledHyperbolicFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          5e-4;

writeControl    adjustableRunTime;

writeInterval   .05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.25;

maxDeltaT       1;

functions
{
    fieldAverage
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        writeControl    writeTime;
        timeStart       5;
        fields
        (
            d.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            moment.1000.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            moment.2000.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            moment.3000.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            alpha.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            U.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
            Theta.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
        );
    }
}


// ************************************************************************* //
